app/controllers/articles_controller.rb

 def create
  @article = Article.new(article_params)
  if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-05-14 05:11:21.516898"], ["text", "投票"], ["title", "helloworld"], ["updated_at", "2014-05-14 05:11:21.516898"]]