app/controllers/signs_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "signs" ("article_id", "created_at", "owner", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_id", 1], ["created_at", "2014-05-14 05:13:08.266401"], ["owner", "ksdfhaksjgl"], ["updated_at", "2014-05-14 05:13:08.266401"]]
---
 def create
     @article = Article.find(params[:article_id])
     @sign = @article.signs.create(sign_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "signs".* FROM "signs"  WHERE "signs"."article_id" = ? AND "signs"."id" = ? LIMIT 1  [["article_id", 7], ["id", 4]]
DELETE FROM "signs" WHERE "signs"."id" = ?  [["id", 4]]
---
   def destroy
    @article = Article.find(params[:article_id])
    @sign = @article.signs.find(params[:id])
    @sign.destroy